{"meta":{"title":"Homepage","subtitle":"","description":"Homepage","author":"Yuetai Li","url":"https://yuetl9.github.io","root":"/"},"pages":[],"posts":[{"title":"homepage","slug":"hello-world","date":"2099-09-09T01:09:09.000Z","updated":"2023-04-12T18:17:00.333Z","comments":true,"path":"hello-world.html","link":"","permalink":"https://yuetl9.github.io/hello-world.html","excerpt":"","text":"About MeI am an undergraduate major in Communication Engineering at University of Electronic Science and Technology of China (UESTC) and University of Glasgow (UofG). During my undergrad, I am advised by Prof. Lei Zhang from the University of Glasgow. My [CV](updated 12.23, 2022) shows more details. Research InterestsIt is worth noting that there are three different consensus theories known in control, distributed computer systems, and human social psychology. It seems that consensus shows its significance in the philosophy of distributed scenarios. I summarize that they emphasize group intelligence to be dynamic, reliable, and cognitive, respectively. My previous work aimed to explore consensus of computers in distributed intelligent systems for reliability. For my future research, exploring the fundamental philosophy behind three consensus theories, and finding new application scenarios or theory foundations of consensus is an intriguing topic. My Research Proposal shows more detals. Publications(Updated 12. 23, 2022) Zhangchen Xu, Yuetai Li, Chenglin Feng, Lei Zhang, “Voting Validity: Exact Fault-tolerant Consensus”, Accepted by the 37th IEEE International Parallel &amp; Distributed Processing Symposium (IPDPS), December 2022 Yuetai Li, Yixuan Fan, Lei Zhang, Jon Crowcroft, “RAFT Consensus Reliability in Wireless Networks: Probabilistic Analysis”, submitted to IEEE Internet of Things Journal, May 2022, under review Yuetai Li, Zhangchen Xu, Lei Zhang, “A Modularized Framework of Communication in Consensus and Consensus Network Reliability Analysis”, in progress Dachao Yu, Yao Sun, Yuetai Li, Lei Zhang, “Communication Resource Allocation of Raft in Wireless Network”, submitted to Elsevier Digital Communications and Networks, November 2022, under review Yuetai Li, Tong Tong, Benhao Pan, Huajun Yang, Ping Jiang, Weinan Caiyang, “Three-mirror system design for shaping the elliptical beam of a laser diode”, Published in Elsevier Optik, Volume 264, 2022 Yuetai Li, Xinbin Chen, Jiale Wang, Tao Zhan, Huajun Yang, Weinan Caiyang, Ping Jiang, “Shaping and transmitting elliptical beam from laser diode by off-axis quadric reflective mirrors”, Published in Elsevier Optics Communications, Volume 493, 2021","categories":[],"tags":[{"name":"Example","slug":"Example","permalink":"https://yuetl9.github.io/tags/Example/"}]}],"categories":[],"tags":[{"name":"Example","slug":"Example","permalink":"https://yuetl9.github.io/tags/Example/"}]}